<template>
    <div class="content">
        <h1>Политика конфиденциальности</h1>
        <div class="wrapper">
            <h2>1. Общие положения</h2>
            <p>
                <b>1.1.</b> В настоящем документе и вытекающих или связанных с ним отношениях Сторон применяются следующие термины и определения:

                <br>
                <br>

                <b>1.1.1. Персональные данные</b> – предоставляемые субъектом персональных данных или его представителем данные, объем и состав которых указаны в п.Х.Х. Политики.

                <br>
                <br>

                <b>1.1.2. Администрация</b> – лицо, занимающее ответственность за обеспечение безопасности, функционирования и использования Сайта.

                <br>
                <br>

                <b>1.1.3. Пользователь</b> – лицо, использующее Сайт в целях заключения и/или исполнения Договоров.

                <br>
                <br>

                <b>1.1.4. Договор</b> – пользовательское соглашение использование Сайта и/или иное соглашение, предлагаемое к заключению и/или заключенное Пользователем на основании любой оферты, размещенной на Сайте.

                <br>
                <br>

                <b>1.1.5. Обработка персональных данных</b> – действие (операция) или совокупность действий (операций) с персональными данными, перечисленные в п.Х.Х. Политики.

                <br>
                <br>

                <b>1.1.6. Сайт</b> – автоматизированная информационная система, доступная в сети Интернет по сетевому адресу: /URL/.

                <br>
                <br>

                <b>1.2.</b> В настоящей Политике используются термины и определения, предусмотренные Соглашением, а также иными заключаемыми с Пользователем Договорами, если иное не предусмотрено настоящей Политикой или не вытекает из ее существа. В иных случаях толкование применяемого в Политике термина производится в соответствии с действующим законодательством Российской Федерации, или обычаями делового оборота.
            </p>

            <br>
            <br>

            <h2>2. Cбор персональных данных</h2>
            <p>
                <b>2.1.</b> Сбор персональных данных осуществляется в целях заключения и/или исполнения Договоров.

                <br>
                <br>

                <b>2.2.</b> В процессе пользования Сайтом собираются такие персональные данные как: ID профиля, имя и фамилия пользователя, список групп, места обучения с профиля пользователя в социальной сети VK.

                <br>
                <br>

                <b>2.3.</b> Персональные данные не будут переданы третьим лицам или предоставлены в случаях, предусмотренных законодательством.
            </p>

            <br>
            <br>

            <h2>3. Правовые основания обработки персональных данных</h2>
            <p>
                <b>3.1.</b> В процессе пользования Сайтом не запрашиваются персональные данные, которые необходимы для заключения и/или исполнения Договоров. Все используемые персональные данные будут обработаны в соответствии с требованиями законодательства Российской Федерации. 

                <br>
                <br>

                <b>3.2.</b> Правовые основания передачи персональных данных лежат в правовом поле законодательства Российской Федерации и соцальной сети VK.
            </p>

            <br>
            <br>

            <h2>4. Порядок и условия обработки персональных данных</h2>
            <p>
                <b>4.1.</b> Персональные данные будут обработаны в целях заключения и/или исполнения Договоров.

                <br>
                <br>

                <b>4.2.</b> Персональные данные обрабатываются в соответствии с требованиями законодательства Российской Федерации 152-ФЗ.

                <br>
                <br>

                <b>4.3.</b> В процессе эксплуатации Сайта не требуются сертификаты и/или документы, которые могут содержать персональные данные.

                <br>
                <br>

                <b>4.4.</b> Мы не храним персональные данные в открытом/закрытом доступе.
            </p>

            <br>
            <br>

            <h2>5. Обработка обезличенных данных</h2>
            <p>
                <b>5.1.</b> Обезличенные данные будут храниться в целях заключения и/или исполнения Договоров.

                <br>
                <br>

                <b>5.2.</b> К обезличенным данным относятся такие данные как:

                <br>
                <br>

                <b>5.2.1. Данные браузера</b> (тип, версия, cookie).

                <br>
                <br>

                <b>5.2.2. Данные устройства и место его положения</b>.

                <br>
                <br>

                <b>5.2.3. Данные операционной системы</b> (тип, версия, разрешение экрана).

                <br>
                <br>

                <b>5.2.4. Данные запроса</b> (время, источник перехода, IP-адрес).
            </p>

            <br>
            <br>

            <h2>6. Изменения политики конфиденциальности</h2>
            <p>
                <b>6.1.</b> Администрация Сайта может изменить политику конфиденциальности в любой момент. Мы не обязаны уведомлять вас об этих изменениях.
            </p>
        </div>
    </div>
</template>

<script setup>
</script>

<style lang="scss" scoped>
.wrapper {
    width: 100%;
}

.content {
    width: 95%;
    margin: 0 auto;
    display: flex;
    flex-direction: column;
    align-items: center;
}

h1 {
    font-size: 40px;
    text-align: center;

    @media (max-width: 768px) {
        font-size: 30px;
    }
}

p {
    font-size: 20px;
    text-align: start;

    @media (max-width: 768px) {
        font-size: 18px;
    }

    color: var(--yw-clr-black);
}
</style>